# Задайте список из n чисел последовательности (1 + 1/n)^n и выведите на экран их сумму.

# Пример:
# - Для n = 6: {1: 4, 2: 7, 3: 10, 4: 13, 5: 16, 6: 19},

n = int(input("Введите число N: "))

result = [0] * n
summ = 0
for i in range(n):
    result[i] = (1 + 1/(i + 1))**(i+1)
    summ += result[i]

print(f"Последовательность: {result}")
print(f"Сумма: {summ}")